{
    "Customer Obsession": [
        "Tell me about a time you went above and beyond for a customer.",
        "How do you incorporate customer feedback into your work?",
        "Describe a situation where you had to advocate for the customer.",
        "When have you prioritized customer needs over business goals?",
        "How do you ensure your product/service meets customer expectations?"
    ],
    "Ownership": [
        "Describe a time you took responsibility for a project beyond your role.",
        "Tell me about a situation where you had to fix a mistake you didn’t cause.",
        "Have you ever had to step up as a leader unexpectedly?",
        "How do you ensure accountability within your team?",
        "Tell me about a time you owned an outcome end-to-end."
    ],
    "Invent and Simplify": [
        "Tell me about a time you simplified a complex process.",
        "Have you created a solution that didn’t exist before?",
        "Describe an innovation you implemented.",
        "When did you challenge the status quo?",
        "How do you balance innovation with efficiency?"
    ],
    "Are Right, A Lot": [
        "Describe a time when your judgment led to a successful outcome.",
        "How do you validate your ideas or decisions?",
        "Tell me about a time you were wrong—what did you learn?",
        "How do you incorporate data and intuition in decision-making?",
        "Describe a tough decision where you had to rely on your experience."
    ],
    "Learn and Be Curious": [
        "What’s something new you've learned recently and how?",
        "Tell me about a time your curiosity led to a breakthrough.",
        "Describe a time you pursued learning outside of work.",
        "How do you stay updated with industry trends?",
        "Have you ever changed your approach after learning something new?"
    ],
    "Hire and Develop the Best": [
        "How do you evaluate potential in candidates?",
        "Tell me about a time you helped a teammate grow.",
        "Describe your approach to mentorship.",
        "Have you ever had to let someone go who wasn’t a good fit?",
        "How do you build a strong team?"
    ],
    "Insist on the Highest Standards": [
        "Tell me about a time you weren’t satisfied with a project’s quality.",
        "How do you maintain high standards under pressure?",
        "Describe a time you challenged mediocrity.",
        "How do you ensure quality in your work?",
        "Have you ever had to push back against a deadline for quality?"
    ],
    "Think Big": [
        "Describe a visionary idea you had and how you executed it.",
        "Tell me about a time you set ambitious goals.",
        "How do you inspire others to think big?",
        "Have you ever failed because you didn’t think big enough?",
        "When did you scale a small idea into something impactful?"
    ],
    "Bias for Action": [
        "Describe a time you made a quick decision with limited data.",
        "Tell me about a risk you took and what happened.",
        "How do you avoid analysis paralysis?",
        "Have you ever been criticized for acting too quickly?",
        "When did acting fast help you capitalize on an opportunity?"
    ],
    "Frugality": [
        "Tell me about a time you delivered results with limited resources.",
        "Describe a cost-saving idea you implemented.",
        "How do you maximize impact without increasing budget?",
        "When did you find a creative workaround for a budget issue?",
        "What’s your approach to resource management?"
    ],
    "Earn Trust": [
        "How do you build trust with new colleagues?",
        "Tell me about a time you lost someone’s trust—how did you fix it?",
        "When did transparency help you earn credibility?",
        "Describe a conflict you resolved by building trust.",
        "How do you maintain trust across diverse teams?"
    ],
    "Dive Deep": [
        "Tell me about a time you uncovered a root cause no one else saw.",
        "How do you ensure thorough understanding of a problem?",
        "Describe a time you used data to solve a problem.",
        "Have you ever challenged assumptions with detailed analysis?",
        "When did you go beyond surface-level information to make a decision?"
    ],
    "Have Backbone; Disagree and Commit": [
        "Tell me about a time you challenged your boss or team.",
        "How do you handle disagreement in a team setting?",
        "Describe a time you strongly disagreed with a decision but followed through.",
        "When did standing your ground lead to a better outcome?",
        "How do you balance assertiveness with collaboration?"
    ],
    "Deliver Results": [
        "Tell me about a time you had to meet a tight deadline.",
        "How do you prioritize tasks to deliver on goals?",
        "Describe a time when you exceeded expectations.",
        "When did you face obstacles but still delivered results?",
        "What’s your approach to ensuring consistent performance?"
    ],
    "Strive to be Earth’s Best Employer": [
        "How do you foster a safe and inclusive work environment?",
        "Tell me about a time you advocated for someone on your team.",
        "What initiatives have you taken to improve team morale?",
        "Describe how you promote diversity, equity, and inclusion.",
        "How do you contribute to making your workplace better for everyone?"
    ],
    "Success and Scale Bring Broad Responsibility": [
        "How do you think about long-term impact of your work?",
        "Tell me about a time you made a sustainable decision.",
        "When did you advocate for responsible practices at scale?",
        "Describe a decision where you balanced growth with ethics.",
        "How do you ensure your team’s actions positively impact others?"
    ]
}